def perimeter(a, b):
""" Вычисляет периметр прямоугольника по удвоенной сумме сторон
	
	Параметры:
	a(int, float): первое десятичное число
	в(int, float): второе десятичное число
	
	Возвращает:
	int, float: Периметр прямоугольника

	Пример использования:
	>>> perimeter(2, 4)
	12"""

    return 2 * a + 2 * b

def area(a, b):
 	""" Вычисляет площадь прямоугольника по двум сторонам

	Параметры:
	a(int, float): первое десятичное число
	b(int, float): второе десятичное число

	Возвращает:
	int, float: Площадь прямоугольника

	Пример использования:
	>>> area(3, 4):
	12"""

    return a * b
